results/async_simple_tc2.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/job/async/simple
Document Length:        28 bytes

Concurrency Level:      1
Time taken for tests:   0.963 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      80500 bytes
HTML transferred:       14000 bytes
Requests per second:    519.02 [#/sec] (mean)
Time per request:       1.927 [ms] (mean)
Time per request:       1.927 [ms] (mean, across all concurrent requests)
Transfer rate:          81.60 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       8
Processing:     1    2   3.5      1      78
Waiting:        0    1   3.5      1      78
Total:          1    2   3.6      1      78

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      2
  75%      2
  80%      2
  90%      2
  95%      3
  98%      6
  99%      7
 100%     78 (longest request)