results/async_thread-pool_tc1.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/job/async/thread-pool
Document Length:        33 bytes

Concurrency Level:      1
Time taken for tests:   0.154 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      16600 bytes
HTML transferred:       3300 bytes
Requests per second:    648.89 [#/sec] (mean)
Time per request:       1.541 [ms] (mean)
Time per request:       1.541 [ms] (mean, across all concurrent requests)
Transfer rate:          105.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     1    1   0.7      1       7
Waiting:        1    1   0.6      1       7
Total:          1    1   0.7      1       7

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      2
  90%      2
  95%      2
  98%      3
  99%      7
 100%      7 (longest request)