results/async_thread-pool_tc3.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/job/async/thread-pool
Document Length:        33 bytes

Concurrency Level:      10
Time taken for tests:   0.755 seconds
Complete requests:      500
Failed requests:        380
   (Connect: 0, Receive: 0, Length: 380, Exceptions: 0)
Non-2xx responses:      380
Total transferred:      2898972 bytes
HTML transferred:       2843112 bytes
Requests per second:    661.88 [#/sec] (mean)
Time per request:       15.109 [ms] (mean)
Time per request:       1.511 [ms] (mean, across all concurrent requests)
Transfer rate:          3747.58 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.9      0       7
Processing:     1   14  18.5      8     179
Waiting:        1   14  17.7      8     179
Total:          1   15  18.5      9     179
WARNING: The median and mean for the initial connection time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     14
  75%     17
  80%     20
  90%     34
  95%     48
  98%     72
  99%    106
 100%    179 (longest request)