results/kafka_tc2.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/job/kafka
Document Length:        23 bytes

Concurrency Level:      1
Time taken for tests:   0.800 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      78000 bytes
HTML transferred:       11500 bytes
Requests per second:    625.28 [#/sec] (mean)
Time per request:       1.599 [ms] (mean)
Time per request:       1.599 [ms] (mean, across all concurrent requests)
Transfer rate:          95.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       4
Processing:     1    1   0.3      1       4
Waiting:        1    1   0.3      1       4
Total:          1    1   0.4      1       7

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      2
  80%      2
  90%      2
  95%      2
  98%      3
  99%      3
 100%      7 (longest request)