results/rabbitmq_tc1.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/job/rabbitmq
Document Length:        26 bytes

Concurrency Level:      1
Time taken for tests:   0.203 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      15900 bytes
HTML transferred:       2600 bytes
Requests per second:    492.52 [#/sec] (mean)
Time per request:       2.030 [ms] (mean)
Time per request:       2.030 [ms] (mean, across all concurrent requests)
Transfer rate:          76.48 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:     1    2   0.7      1       6
Waiting:        1    1   0.8      1       6
Total:          1    2   0.8      2       6
WARNING: The median and mean for the processing time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      2
  80%      2
  90%      3
  95%      4
  98%      4
  99%      6
 100%      6 (longest request)